#+title: an adder in j:
* COMMENT
#+begin_src J :session

#+end_src

#+RESULTS:
: No entry for terminal type "dumb";
: using dumb terminal settings.

* a half adder
:PROPERTIES:
:TS:       <2014-03-05 07:20AM>
:ID:       bdsk2970veg0
:header-args:  :exports both  :session
:END:

#+begin_src J
 ( ~:/~ ; *./~ ) 0 1   NB. sum is ~: (xor)   carry is *. (and)
#+end_src

#+RESULTS:
: ┌───┬───┐
: │0 1│0 0│
: │1 0│0 1│
: └───┴───┘

#+begin_src J
  ha =: (~: , *.)"0
  (0 ha 0); (0 ha 1); (1 ha 0); (1 ha 1)
#+end_src

#+RESULTS:
: ┌───┬───┬───┬───┐
: │0 0│1 0│1 0│0 1│
: └───┴───┴───┴───┘

#+begin_src J
  < @ ha /~ 0 1
#+end_src

#+RESULTS:
: ┌───┬───┐
: │0 0│1 0│
: ├───┼───┤
: │1 0│0 1│
: └───┴───┘

#+begin_src J
  NB. compare to http://en.wikipedia.org/wiki/Adder_(electronics)
  A ,. B ,. C ,. S  NB. C=carry, S=sum for inputs A and B
#+end_src

#+RESULTS:
: A ,. B ,. C ,. S



* NOTE . representing a byte
:PROPERTIES:
:TS:       <2014-03-05 07:55AM>
:ID:       m80g9v80veg0
:header-args:  :exports both  :session
:END:

#+begin_src J
  byte =: (( _8 {. #: ) :. #. )"0
#+end_src

#+RESULTS:

#+begin_src J
  byte 0 1 2 170 255
#+end_src

#+RESULTS:
: 0 0 0 0 0 0 0 0
: 0 0 0 0 0 0 0 1
: 0 0 0 0 0 0 1 0
: 1 0 1 0 1 0 1 0
: 1 1 1 1 1 1 1 1

#+begin_src J
  _ * byte 0 1 2 170 255
#+end_src

#+RESULTS:
: 0 0 0 0 0 0 0 0
: 0 0 0 0 0 0 0 _
: 0 0 0 0 0 0 _ 0
: _ 0 _ 0 _ 0 _ 0
: _ _ _ _ _ _ _ _

#+begin_src J
  (u: 9617 9619) {~ byte 0 1 2 170 255
#+end_src

#+RESULTS:
: ░░░░░░░░
: ░░░░░░░▓
: ░░░░░░▓░
: ▓░▓░▓░▓░
: ▓▓▓▓▓▓▓▓

#+begin_src J
(u: 9617 9608) {~ byte 0 1 2 170 255
#+end_src

#+RESULTS:
: ░░░░░░░░
: ░░░░░░░█
: ░░░░░░█░
: █░█░█░█░
: ████████

#+begin_src J
  shade =: (u: 32 9617 9618 9619 9608) {~ ]
  widen =: (2: # ])"1
  drawbyte =: shade 1 + 3 * [: widen byte
  drawbyte 0 1 2 170 255
#+end_src

#+RESULTS:
: ░░░░░░░░░░░░░░░░
: ░░░░░░░░░░░░░░██
: ░░░░░░░░░░░░██░░
: ██░░██░░██░░██░░
: ████████████████


* LINK . references
:PROPERTIES:
:TS:       <2014-03-05 07:59PM>
:ID:       3yr2bd61veg0
:END:
http://en.wikipedia.org/wiki/Adder_(electronics)
